import ServiceIcon1 from "@/assets/svgs/services/services-icon-1.svg?component";
import ServiceIcon2 from "@/assets/svgs/services/services-icon-2.svg?component";
import ServiceIcon3 from "@/assets/svgs/services/services-icon-3.svg?component";
import ServiceIcon4 from "@/assets/svgs/services/services-icon-4.svg?component";
import type { MaterialCategory } from "@/types/materials";

export const materialsData: MaterialCategory[] = [
  {
    id: "cat-internet",
    icon: <ServiceIcon1 />,
    title: "Інтернет",
    marginTop: "56px",
    points: [
      {
        id: "router-setup",
        title: "Як налаштувати роутер самостійно",
        modalContent: {
          title: "Як налаштувати роутер за 5 хвилин",
          subtitle:
            "Налаштувати Wi-Fi роутер можна швидко і просто. Ось головні кроки:",
          content: [
            {
              type: "paragraph",
              lead: "Підключіть кабелі.",
              text: "Кабель від інтернет-провайдера вставте у синій порт (WAN), а комп’ютер підключіть до жовтого порту (LAN). Увімкніть роутер в розетку.",
            },
            {
              type: "paragraph",
              lead: "Увійдіть в налаштування.",
              text: "У браузері на комп’ютері введіть адресу 192.168.0.1 або 192.168.1.1. Логін та пароль зазвичай admin / admin (дивіться на наліпці на роутері).",
            },
            {
              type: "paragraph",
              lead: "Налаштуйте Wi-Fi.",
              text: 'Знайдіть розділ "Бездротова мережа" (Wireless).',
              list: [
                {
                  text: "Ім’я мережі (SSID): Впишіть свою назву для Wi-Fi.",
                },
                {
                  text: "Пароль: Встановіть надійний пароль (тип захисту WPA2/WPA3).",
                },
              ],
            },
            {
              type: "paragraph",
              lead: "Змініть пароль доступу.",
              text: 'В розділі "Система" або "Адміністрування" змініть стандартний пароль "admin" на свій власний для безпеки.',
            },
          ],
        },
      },
      {
        id: "internet-down",
        title: "Що робити, якщо зник інтернет",
        modalContent: {
          title: "Як налаштувати роутер за 5 хвилин",
          subtitle:
            "Налаштувати Wi-Fi роутер можна швидко і просто. Ось головні кроки:",
          content: [
            {
              type: "paragraph",
              lead: "Підключіть кабелі.",
              text: "Кабель від інтернет-провайдера вставте у синій порт (WAN), а комп’ютер підключіть до жовтого порту (LAN). Увімкніть роутер в розетку.",
            },
            {
              type: "paragraph",
              lead: "Увійдіть в налаштування.",
              text: "У браузері на комп’ютері введіть адресу 192.168.0.1 або 192.168.1.1. Логін та пароль зазвичай admin / admin (дивіться на наліпці на роутері).",
            },
            {
              type: "paragraph",
              lead: "Налаштуйте Wi-Fi.",
              text: 'Знайдіть розділ "Бездротова мережа" (Wireless).',
              list: [
                {
                  text: "Ім’я мережі (SSID): Впишіть свою назву для Wi-Fi.",
                },
                {
                  text: "Пароль: Встановіть надійний пароль (тип захисту WPA2/WPA3).",
                },
              ],
            },
            {
              type: "paragraph",
              lead: "Змініть пароль доступу.",
              text: 'В розділі "Система" або "Адміністрування" змініть стандартний пароль "admin" на свій власний для безпеки.',
            },
          ],
        },
      },
      {
        id: "stable-wifi",
        title: (
          <>
            Поради для стабільного <br />
            Wi-Fi у квартирі
          </>
        ),
        modalContent: {
          title: "Як налаштувати роутер за 5 хвилин",
          subtitle:
            "Налаштувати Wi-Fi роутер можна швидко і просто. Ось головні кроки:",
          content: [
            {
              type: "paragraph",
              lead: "Підключіть кабелі.",
              text: "Кабель від інтернет-провайдера вставте у синій порт (WAN), а комп’ютер підключіть до жовтого порту (LAN). Увімкніть роутер в розетку.",
            },
            {
              type: "paragraph",
              lead: "Увійдіть в налаштування.",
              text: "У браузері на комп’ютері введіть адресу 192.168.0.1 або 192.168.1.1. Логін та пароль зазвичай admin / admin (дивіться на наліпці на роутері).",
            },
            {
              type: "paragraph",
              lead: "Налаштуйте Wi-Fi.",
              text: 'Знайдіть розділ "Бездротова мережа" (Wireless).',
              list: [
                {
                  text: "Ім’я мережі (SSID): Впишіть свою назву для Wi-Fi.",
                },
                {
                  text: "Пароль: Встановіть надійний пароль (тип захисту WPA2/WPA3).",
                },
              ],
            },
            {
              type: "paragraph",
              lead: "Змініть пароль доступу.",
              text: 'В розділі "Система" або "Адміністрування" змініть стандартний пароль "admin" на свій власний для безпеки.',
            },
          ],
        },
      },
    ],
  },
  {
    id: "cat-tv",
    icon: <ServiceIcon2 />,
    title: "Телебачення",
    marginTop: "220px",
    points: [
      {
        id: "setup-smart-tv",
        title: "Як підключити Smart TV до нашого сервісу",
        modalContent: {
          title: "Як налаштувати роутер за 5 хвилин",
          subtitle:
            "Налаштувати Wi-Fi роутер можна швидко і просто. Ось головні кроки:",
          content: [
            {
              type: "paragraph",
              lead: "Підключіть кабелі.",
              text: "Кабель від інтернет-провайдера вставте у синій порт (WAN), а комп’ютер підключіть до жовтого порту (LAN). Увімкніть роутер в розетку.",
            },
            {
              type: "paragraph",
              lead: "Увійдіть в налаштування.",
              text: "У браузері на комп’ютері введіть адресу 192.168.0.1 або 192.168.1.1. Логін та пароль зазвичай admin / admin (дивіться на наліпці на роутері).",
            },
            {
              type: "paragraph",
              lead: "Налаштуйте Wi-Fi.",
              text: 'Знайдіть розділ "Бездротова мережа" (Wireless).',
              list: [
                {
                  text: "Ім’я мережі (SSID): Впишіть свою назву для Wi-Fi.",
                },
                {
                  text: "Пароль: Встановіть надійний пароль (тип захисту WPA2/WPA3).",
                },
              ],
            },
            {
              type: "paragraph",
              lead: "Змініть пароль доступу.",
              text: 'В розділі "Система" або "Адміністрування" змініть стандартний пароль "admin" на свій власний для безпеки.',
            },
          ],
        },
      },
      {
        id: "setup-interactive-tv",
        title: "Налаштування інтерактивного телебачення",
        modalContent: {
          title: "Як налаштувати роутер за 5 хвилин",
          subtitle:
            "Налаштувати Wi-Fi роутер можна швидко і просто. Ось головні кроки:",
          content: [
            {
              type: "paragraph",
              lead: "Підключіть кабелі.",
              text: "Кабель від інтернет-провайдера вставте у синій порт (WAN), а комп’ютер підключіть до жовтого порту (LAN). Увімкніть роутер в розетку.",
            },
            {
              type: "paragraph",
              lead: "Увійдіть в налаштування.",
              text: "У браузері на комп’ютері введіть адресу 192.168.0.1 або 192.168.1.1. Логін та пароль зазвичай admin / admin (дивіться на наліпці на роутері).",
            },
            {
              type: "paragraph",
              lead: "Налаштуйте Wi-Fi.",
              text: 'Знайдіть розділ "Бездротова мережа" (Wireless).',
              list: [
                {
                  text: "Ім’я мережі (SSID): Впишіть свою назву для Wi-Fi.",
                },
                {
                  text: "Пароль: Встановіть надійний пароль (тип захисту WPA2/WPA3).",
                },
              ],
            },
            {
              type: "paragraph",
              lead: "Змініть пароль доступу.",
              text: 'В розділі "Система" або "Адміністрування" змініть стандартний пароль "admin" на свій власний для безпеки.',
            },
          ],
        },
      },
      {
        id: "signal-lost",
        title: "Що робити, якщо пропав сигнал",
        modalContent: {
          title: "Як налаштувати роутер за 5 хвилин",
          subtitle:
            "Налаштувати Wi-Fi роутер можна швидко і просто. Ось головні кроки:",
          content: [
            {
              type: "paragraph",
              lead: "Підключіть кабелі.",
              text: "Кабель від інтернет-провайдера вставте у синій порт (WAN), а комп’ютер підключіть до жовтого порту (LAN). Увімкніть роутер в розетку.",
            },
            {
              type: "paragraph",
              lead: "Увійдіть в налаштування.",
              text: "У браузері на комп’ютері введіть адресу 192.168.0.1 або 192.168.1.1. Логін та пароль зазвичай admin / admin (дивіться на наліпці на роутері).",
            },
            {
              type: "paragraph",
              lead: "Налаштуйте Wi-Fi.",
              text: 'Знайдіть розділ "Бездротова мережа" (Wireless).',
              list: [
                {
                  text: "Ім’я мережі (SSID): Впишіть свою назву для Wi-Fi.",
                },
                {
                  text: "Пароль: Встановіть надійний пароль (тип захисту WPA2/WPA3).",
                },
              ],
            },
            {
              type: "paragraph",
              lead: "Змініть пароль доступу.",
              text: 'В розділі "Система" або "Адміністрування" змініть стандартний пароль "admin" на свій власний для безпеки.',
            },
          ],
        },
      },
    ],
  },
  {
    id: "cat-security",
    icon: <ServiceIcon3 />,
    title: "Системи безпеки",
    marginTop: "56px",
    points: [
      {
        id: "choose-camera",
        title: "Як обрати відеокамеру для дому чи офісу",
        modalContent: {
          title: "Як налаштувати роутер за 5 хвилин",
          subtitle:
            "Налаштувати Wi-Fi роутер можна швидко і просто. Ось головні кроки:",
          content: [
            {
              type: "paragraph",
              lead: "Підключіть кабелі.",
              text: "Кабель від інтернет-провайдера вставте у синій порт (WAN), а комп’ютер підключіть до жовтого порту (LAN). Увімкніть роутер в розетку.",
            },
            {
              type: "paragraph",
              lead: "Увійдіть в налаштування.",
              text: "У браузері на комп’ютері введіть адресу 192.168.0.1 або 192.168.1.1. Логін та пароль зазвичай admin / admin (дивіться на наліпці на роутері).",
            },
            {
              type: "paragraph",
              lead: "Налаштуйте Wi-Fi.",
              text: 'Знайдіть розділ "Бездротова мережа" (Wireless).',
              list: [
                {
                  text: "Ім’я мережі (SSID): Впишіть свою назву для Wi-Fi.",
                },
                {
                  text: "Пароль: Встановіть надійний пароль (тип захисту WPA2/WPA3).",
                },
              ],
            },
            {
              type: "paragraph",
              lead: "Змініть пароль доступу.",
              text: 'В розділі "Система" або "Адміністрування" змініть стандартний пароль "admin" на свій власний для безпеки.',
            },
          ],
        },
      },
      {
        id: "security-setup",
        title: "Інструкція з підключення сигналізації",
        modalContent: {
          title: "Як налаштувати роутер за 5 хвилин",
          subtitle:
            "Налаштувати Wi-Fi роутер можна швидко і просто. Ось головні кроки:",
          content: [
            {
              type: "paragraph",
              lead: "Підключіть кабелі.",
              text: "Кабель від інтернет-провайдера вставте у синій порт (WAN), а комп’ютер підключіть до жовтого порту (LAN). Увімкніть роутер в розетку.",
            },
            {
              type: "paragraph",
              lead: "Увійдіть в налаштування.",
              text: "У браузері на комп’ютері введіть адресу 192.168.0.1 або 192.168.1.1. Логін та пароль зазвичай admin / admin (дивіться на наліпці на роутері).",
            },
            {
              type: "paragraph",
              lead: "Налаштуйте Wi-Fi.",
              text: 'Знайдіть розділ "Бездротова мережа" (Wireless).',
              list: [
                {
                  text: "Ім’я мережі (SSID): Впишіть свою назву для Wi-Fi.",
                },
                {
                  text: "Пароль: Встановіть надійний пароль (тип захисту WPA2/WPA3).",
                },
              ],
            },
            {
              type: "paragraph",
              lead: "Змініть пароль доступу.",
              text: 'В розділі "Система" або "Адміністрування" змініть стандартний пароль "admin" на свій власний для безпеки.',
            },
          ],
        },
      },
      {
        id: "backup-records",
        title: "Поради для безпечного зберігання записів",
        modalContent: {
          title: "Як налаштувати роутер за 5 хвилин",
          subtitle:
            "Налаштувати Wi-Fi роутер можна швидко і просто. Ось головні кроки:",
          content: [
            {
              type: "paragraph",
              lead: "Підключіть кабелі.",
              text: "Кабель від інтернет-провайдера вставте у синій порт (WAN), а комп’ютер підключіть до жовтого порту (LAN). Увімкніть роутер в розетку.",
            },
            {
              type: "paragraph",
              lead: "Увійдіть в налаштування.",
              text: "У браузері на комп’ютері введіть адресу 192.168.0.1 або 192.168.1.1. Логін та пароль зазвичай admin / admin (дивіться на наліпці на роутері).",
            },
            {
              type: "paragraph",
              lead: "Налаштуйте Wi-Fi.",
              text: 'Знайдіть розділ "Бездротова мережа" (Wireless).',
              list: [
                {
                  text: "Ім’я мережі (SSID): Впишіть свою назву для Wi-Fi.",
                },
                {
                  text: "Пароль: Встановіть надійний пароль (тип захисту WPA2/WPA3).",
                },
              ],
            },
            {
              type: "paragraph",
              lead: "Змініть пароль доступу.",
              text: 'В розділі "Система" або "Адміністрування" змініть стандартний пароль "admin" на свій власний для безпеки.',
            },
          ],
        },
      },
    ],
  },
  {
    id: "cat-iot",
    icon: <ServiceIcon4 />,
    title: "IoT та M2M",
    marginTop: "220px",
    points: [
      {
        id: "iot-examples",
        title: "Приклади використання IoT у побуті",
        modalContent: {
          title: "Як налаштувати роутер за 5 хвилин",
          subtitle:
            "Налаштувати Wi-Fi роутер можна швидко і просто. Ось головні кроки:",
          content: [
            {
              type: "paragraph",
              lead: "Підключіть кабелі.",
              text: "Кабель від інтернет-провайдера вставте у синій порт (WAN), а комп’ютер підключіть до жовтого порту (LAN). Увімкніть роутер в розетку.",
            },
            {
              type: "paragraph",
              lead: "Увійдіть в налаштування.",
              text: "У браузері на комп’ютері введіть адресу 192.168.0.1 або 192.168.1.1. Логін та пароль зазвичай admin / admin (дивіться на наліпці на роутері).",
            },
            {
              type: "paragraph",
              lead: "Налаштуйте Wi-Fi.",
              text: 'Знайдіть розділ "Бездротова мережа" (Wireless).',
              list: [
                {
                  text: "Ім’я мережі (SSID): Впишіть свою назву для Wi-Fi.",
                },
                {
                  text: "Пароль: Встановіть надійний пароль (тип захисту WPA2/WPA3).",
                },
              ],
            },
            {
              type: "paragraph",
              lead: "Змініть пароль доступу.",
              text: 'В розділі "Система" або "Адміністрування" змініть стандартний пароль "admin" на свій власний для безпеки.',
            },
          ],
        },
      },
      {
        id: "m2m-for-business",
        title: "Як працює M2M для бізнесу",
        modalContent: {
          title: "Як налаштувати роутер за 5 хвилин",
          subtitle:
            "Налаштувати Wi-Fi роутер можна швидко і просто. Ось головні кроки:",
          content: [
            {
              type: "paragraph",
              lead: "Підключіть кабелі.",
              text: "Кабель від інтернет-провайдера вставте у синій порт (WAN), а комп’ютер підключіть до жовтого порту (LAN). Увімкніть роутер в розетку.",
            },
            {
              type: "paragraph",
              lead: "Увійдіть в налаштування.",
              text: "У браузері на комп’ютері введіть адресу 192.168.0.1 або 192.168.1.1. Логін та пароль зазвичай admin / admin (дивіться на наліпці на роутері).",
            },
            {
              type: "paragraph",
              lead: "Налаштуйте Wi-Fi.",
              text: 'Знайдіть розділ "Бездротова мережа" (Wireless).',
              list: [
                {
                  text: "Ім’я мережі (SSID): Впишіть свою назву для Wi-Fi.",
                },
                {
                  text: "Пароль: Встановіть надійний пароль (тип захисту WPA2/WPA3).",
                },
              ],
            },
            {
              type: "paragraph",
              lead: "Змініть пароль доступу.",
              text: 'В розділі "Система" або "Адміністрування" змініть стандартний пароль "admin" на свій власний для безпеки.',
            },
          ],
        },
      },
      {
        id: "smart-devices",
        title: "Керування розумними пристроями через додаток",
        modalContent: {
          title: "Як налаштувати роутер за 5 хвилин",
          subtitle:
            "Налаштувати Wi-Fi роутер можна швидко і просто. Ось головні кроки:",
          content: [
            {
              type: "paragraph",
              lead: "Підключіть кабелі.",
              text: "Кабель від інтернет-провайдера вставте у синій порт (WAN), а комп’ютер підключіть до жовтого порту (LAN). Увімкніть роутер в розетку.",
            },
            {
              type: "paragraph",
              lead: "Увійдіть в налаштування.",
              text: "У браузері на комп’ютері введіть адресу 192.168.0.1 або 192.168.1.1. Логін та пароль зазвичай admin / admin (дивіться на наліпці на роутері).",
            },
            {
              type: "paragraph",
              lead: "Налаштуйте Wi-Fi.",
              text: 'Знайдіть розділ "Бездротова мережа" (Wireless).',
              list: [
                {
                  text: "Ім’я мережі (SSID): Впишіть свою назву для Wi-Fi.",
                },
                {
                  text: "Пароль: Встановіть надійний пароль (тип захисту WPA2/WPA3).",
                },
              ],
            },
            {
              type: "paragraph",
              lead: "Змініть пароль доступу.",
              text: 'В розділі "Система" або "Адміністрування" змініть стандартний пароль "admin" на свій власний для безпеки.',
            },
          ],
        },
      },
    ],
  },
];
